# 1. установка зависимостей
from ctypes import pythonapi

from anyio.abc import ConnectedUDPSocket

# python -m venv venv
# venv\scripts\activate

#2. Установка библиотек
# pip install fastapi uvicorn sqlalchemy psycopg2-binary alembic asyncpg

# сохранить зависимости в файл
# pip freeze > requirements.txt
#
# pip install -r requirements.txt

#
# main
#
# from fastapi import FastAPI, Depends
# from sqlalchemy.orm import Session
# from app.database import  get_db
#
# app = FastAPI()
#
# @app.get("/check-db")
# def check_db(db: Session = Depends(get_db)):
#     try:
#         db.execute("SELECT 1")  # простой запрос для проверки
#         return {"status": "OK", "detail": "Подключение к базе успешно"}
#     except Exception as e:
#         return {"status": "Error", "detail": str(e)}

# psycopg2-binary — sync-драйвер, нужен Alembic
# (alembic НЕ работает с asyncpg напрямую)
#
# pip install alembic psycopg2-binary

# alembic.ini
#
# alembic init alembic
#
# sqlalchemy.url = driver://user:pass@localhost/dbname
# ->
# sqlalchemy.url = postgresql+psycopg2://postgres:1234@localhost:5432/Test

# alembic/env.py

#
# ВВЕРХУ файла добавь импорты
# import sys
# from pathlib import Path
#
# sys.path.append(str(Path(__file__).resolve().parents[1]))
#
# from app.database import Base
# from app.models import users  # ВАЖНО: импортируем модели
#
#
# чтобы Alembic увидел таблицы.
# Найти строку:
# target_metadata = None
# Заменить:
# target_metadata = Base.metadata


# для подключения к базе данных необходимо перейти в программу pg Admin 4, запустить базу данных
# также для утановления пароля для пользователя необходимо перейти в login/group_role и найти там postgres нажать пкм и выбрать properties
# в открывшемся окне открыть вкладку на Definition (ALTER USER postgres WITH PASSWORD '1234') ввести пароль и схоранить
#
# далее поключение можно проверить через  sql Shell(psql)
# Ввести параметры подключения
#
# Сначала psql попросит ввести:
# Server [localhost]:
# Port [5432]:
# Database [postgres]:Test  (Базаь данных с которой работали на прошлом занятии)
# Username [postgres]:
# Пароль пользователя sql: (указывается свой пароль)
#
# ПРи верном подключении должна появиться Test=#
#
# Можно также напистаь небольшой скрипт на python:
# import asyncio
# import asyncpg
#
# async def main():
#     conn = await asyncpg.connect(
#         user="postgres",
#         password="1234",
#         database="Test",
#         host="localhost",
#         port=5432
#     )
#     print("CONNECTED")
#     await conn.close()
#
# asyncio.run(main())

# при верном подключении мы увидим в консоли Connected
#
#
# теперь настраиваем зависимости
# alembic revision --autogenerate -m "create users table"
#
# если всё ок, то появится
# alembic/versions/xxxxxxxx_create_users_table.py
#
# внутри:
# from typing import Sequence, Union
#
# from alembic import op
# import sqlalchemy as sa
#
#
# # revision identifiers, used by Alembic.
# revision: str = '95c00fb8f4ed'
# down_revision: Union[str, Sequence[str], None] = None
# branch_labels: Union[str, Sequence[str], None] = None
# depends_on: Union[str, Sequence[str], None] = None
#
#
# def upgrade() -> None:
#     """Upgrade schema."""
#     # ### commands auto generated by Alembic - please adjust! ###
#     op.create_table('users',
#     sa.Column('id', sa.Integer(), nullable=False),
#     sa.Column('username', sa.String(length=64), nullable=False),
#     sa.Column('is_active', sa.Boolean(), nullable=False),
#     sa.PrimaryKeyConstraint('id'),
#     sa.UniqueConstraint('username')
#     )
# применение миграций
# alembic upgrade head
#
# через dbeaver можем проверить что таблица появилась
