# Воркшоп. PostgreSQL и SQLModel

# Введение

'''
Сегодня нас ждет воркшоп, где мы будем дорабатывать проект с предыдущих занятий.
При этом у нас уже реализовано немало эндпоинтов:

Users:
POST /users - создать нового пользователя
GET /users - получить список пользователей с фильтрацией и пагинацией
GET /users/{user_id} - получить данные конкретного пользователя
PATCH /users/{user_id} - обновить данные пользователя
DELETE /users/{user_id} - удалить пользователя и связанные с ним items

Items:
GET /items/{item_id} - получить данные конкретного item
PATCH /items/{item_id} - обновить данные item, в том числе - сменить владельца
DELETE /items/{item_id} - удалить item
POST /users/{user_id}/items - создать item с привязкой к пользователю
GET /users/{user_id}/items - получить список items конкретного пользователя

Наша задача на сегодня - добавить новый эндпоинт, а также преобразовать уже существующий код.

СОВЕТ ПРЕПОДАВАТЕЛЮ: на занятии не будет принципиально новой информации.
Старайтесь активно задействовать студентов с учетом имеющегося тайминга.
'''

# --------------------------------------------------------------------------------------------

# Идея одной репозиторной функции для двух эндпоинтов

'''
Итак, сегодня мы будем создавать 1 новый эндпоинт:
GET /items - получить список вообще всех items с пагинацией и фильтрацией
А также будем обновлять существующий эндпоинт:
GET /users/{user_id}/items - получить список всех items конкретного пользователя,
добавим пагинацию и фильтрацию

Эти эндпоинты сильно похожи с одной лишь разницей - применяется ли фильтр по user_id или нет.

С одной стороны, у нас уже есть функция list_items_by_user_id() в файле app/repositories/items.py,
которая возвращает список всех items конкретного пользователя:
'''

# app/repositories/items.py

async def list_items_by_user_id(session: AsyncSession, user_id: UUID) -> list[Item]:
    stmt = select(Item).where(user_id == Item.user_id)
    result = await session.exec(stmt)
    return result.all()

'''
Но эта функция возвращает только список, без фильтрации и пагинации.
Если мы начнем ее расширять, то столкнемся с тем, что для GET /items нужна другая функция,
без работы с user_id. Итого, у нас 2 варианта:
- пишем две разные репозиторные функции, сильно похожие друг на друга
- пишем одну универсальную функцию под оба эндпоинта

Мы пойдем по второму пути и создадим одну основную репозиторную функцию для двух эндпоинтов.
При этом внутри этой функции будет опциональный параметр user_id со следующим сценарием:
- если user_id содержит None - работает GET /items
- если user_id содержит UUID - работает GET /users/{user_id}/items

Перед написание кода давайте быстро обсудим сигнатуры наших эндпоинтов 
и в каком формате будут возвращаться ответы. Похожие эндпоинты мы уже создавали,
поэтому принципиально новых инструментов мы не увидим 😉 

1) GET /items

Пример запроса:
GET /items?q=phone&limit=20&offset=0

q - поиск по title объекта
limit - сколько записей показать на 1 странице
offset - сколько записей нужно пропустить перед возвратом результата

Пример ответа:
{
  "data": [
    {
        "id": "0b7e4773-4f7b-4965-92db-1d427121d3b9", 
        "title": "phone 11", 
        "description": "good camera", 
        "user_id": "be4a97cd-e65d-4af1-aa74-d9d426e61538"
    },
    {
        "id": "0e0e9508-dafe-425b-85f3-2faf4df71ee0", 
        "title": "phone 12 Pro", 
        "description": "big screen", 
        "user_id": "174ad0f3-6a94-461a-8538-f85ca29d9d9a"
    }
  ],
  "count": 123
}

data - записи на текущей странице с учетом limit и offset 
count - общее количество записей с учетом фильтрации

2) GET /users/{user_id}/items

Пример запроса:
GET /users/be4a97cd-e65d-4af1-aa74-d9d426e61538/items?q=phone&limit=9&offset=0

Пример ответа:
{
  "data": [
    {
        "id": "0b7e4773-4f7b-4965-92db-1d427121d3b9", 
        "title": "phone 11", 
        "description": "good camera", 
        "user_id": "be4a97cd-e65d-4af1-aa74-d9d426e61538"
    }
  ],
  "count": 7
}

Как видите, мы используем единый формат ответа и единую схему элемента для обоих эндпоинтов.
Оба эндпоинта возвращают объект вида { "data": [...], "count": N }, так клиент сможет корректно
строить пагинацию.

Также видно, что поле user_id всегда присутствует внутри каждой записи (item), 
даже в GET /users/{user_id}/items, несмотря на то что UUID пользователя есть в URL.
В этом нет ничего страшного:
- единый формат упрощает возможную работу с фронтендом
- снижает количество моделей на стороне бэкенда
- облегчает возможное расширение API
То есть повторно user_id является допустимой избыточностью, при этом повышается
универсальность данных и снижается сложность поддержки.

Остальные подробности мы посмотрим уже на этапе написания кода 😁
'''

# --------------------------------------------------------------------------------------------

# Реализация репозиторных функций для GET /items и GET /users/{user_id}/items

'''
Итак, переходим к файлу app/repositories/items.py. Для реализации нужной логики
мы создадим новую функцию list_items_with_count() и вспомогательную функцию
_apply_items_filters() для описании логики фильтров. Так мы уже делали,
когда писали похожий код app/repositories/users.py.

Для начала посмотрим на импорты. У нас уже все есть, кроме специальной переменной func из sqlmodel,
она нам понадобится для реализации подсчета объектов.
'''

# app/repositories/items.py
...
from sqlmodel import select, func
...

'''
Далее пропишем заголовки наших функций. Пока что без тела, просто укажем сигнатуры,
так нам будет проще реализовывать тела функций:
'''

def _apply_items_filters(stmt, q: str | None, user_id: UUID | None):
    ...


async def list_items_with_count(
    session: AsyncSession,
    q: str | None,
    user_id: UUID | None,
    limit: int,
    offset: int
) -> tuple[list[Item], int]:
    ...

'''
Обратите внимание, что user_id мы сделали опциональным. Если передан None, то фильтр
по пользователю не применяется, значит работает GET /items. Если же передан UUID - 
значит работает GET /users/{user_id}/items.

Перейдем к реализации тела функции _apply_items_filters(). В нашем случае фильтры - 
это условия where, которые мы добавляем, если значение реально передано клиентом.
q - просто строка поиска, мы делаем strip(), чтобы q='  ' не превращалось
в бессмысленный запрос. q мы применяем для поиска по title. В будущем вы можете
расширить эту логику и добавить поиск по description 😎

СОВЕТ ПРЕПОДАВАТЕЛЮ: если у студентов возникают сложности с пониманием работы
функции - делайте отсылки на функцию _apply_users_filters() из файла app/repositories/users.py,
она очень похожа по структуре и логике работы.
'''

def _apply_items_filters(stmt, q: str | None, user_id: UUID | None):
    if user_id is not None:
        stmt = stmt.where(Item.user_id == user_id)
    if q:
        q = q.strip()
        if q:
            stmt = stmt.where(Item.title.ilike(f'%{q}%'))
    return stmt

'''
Далее реализуем тело функции list_items_with_count(), где будем собирать 2 объекта:
- data_stmt - выражение для получения списка объектов на конкретной странице, отсортированого по title
- count_stmt - выражение для получения общего количества объектов с учетом фильтрации

СОВЕТ ПРЕПОДАВАТЕЛЮ: если у студентов возникают сложности с пониманием работы
функции - делайте отсылки на функцию list_users_with_count() из файла app/repositories/users.py,
она очень похожа по структуре и логике работы.
'''

async def list_items_with_count(
    session: AsyncSession,
    q: str | None,
    user_id: UUID | None,
    limit: int,
    offset: int
) -> tuple[list[Item], int]:
    data_stmt = select(Item)
    data_stmt = _apply_items_filters(stmt=data_stmt, q=q, user_id=user_id)
    data_stmt = data_stmt.order_by(Item.title)
    data_stmt = data_stmt.offset(offset).limit(limit)

    data_result = await session.exec(data_stmt)
    items = data_result.all()

    count_stmt = select(func.count()).select_from(Item)
    count_stmt = _apply_items_filters(stmt=count_stmt, q=q, user_id=user_id)

    count_result = await session.exec(count_stmt)
    count = count_result.one()

    return items, count

'''
Супер, теперь у нас есть универсальная функция репозитория, которая подходит для двух эндпоинтов.
Дальше мы будем ее использовать в эндпоинтах GET /items и GET /users/{user_id}/items.
Функцию list_items_by_user_id() пока что оставим, удалим ее после внедрения list_items_with_count().
'''

# --------------------------------------------------------------------------------------------

# Работа с эндпоинтами GET /items и GET /users/{user_id}/items

'''
Переходим к реализации эндпоинтов, начнем с GET /items. 
В файле app/routes/items.py сначала поправим импорты:
- добавим функцию Query() для работы с query-параметрами
- добавим модель ItemsOut
- добавим функцию list_items_with_count()
Итоговый вид импортов:
'''

# app/routes/items.py

from uuid import UUID

from fastapi import APIRouter, HTTPException, Query

from app.database import SessionDep
from app.models.items import ItemOut, ItemUpdate, ItemsOut
from app.repositories.items import get_item, delete_item, patch_item, list_items_with_count
from app.repositories.users import get_user

'''
Теперь реализуем сам эндпоинт GET /items в виде функции read_items().
Не забудем, что user_id нужно передавать со значением None:
'''

@router.get('/', response_model=ItemsOut)
async def read_items(
    session: SessionDep,
    q: str | None = Query(default=None, description='Поиск по названию'),
    limit: int = Query(default=20, ge=1, le=100, description='Количество записей на странице'),
    offset: int = Query(default=0, ge=0, description='Сколько записей пропустить')
):
    items, count = await list_items_with_count(
        session=session,
        q=q,
        limit=limit,
        offset=offset,
        user_id=None
    )

    return ItemsOut(data=items, count=count)

'''
С эндпоинтом GET /items разобрались, теперь идем в файл app/routes/users.py для
обновления эндпоинта GET /users/{user_id}/items. Для начала актуализируем импорты:
- добавим модель ItemsOut
- заменим импорт list_items_by_user_id() на list_items_with_count(), при этом можно
удалить list_items_by_user_id() из файла app/repositories/items.py
'''

# app/routes/users.py
...
from app.models.items import ItemCreate, ItemOut, ItemsOut
from app.repositories.items import create_item as create_item_repository, list_items_with_count

'''
Теперь перейдем к уже существующей функции get_user_items() и актуализируем ее.
Не забудем, что здесь уже нужно передавать user_id:
'''

@router.get('/{user_id}/items', response_model=ItemsOut)
async def get_user_items(
    user_id: UUID,
    session: SessionDep,
    q: str | None = Query(default=None, description='Поиск по названию'),
    limit: int = Query(default=20, ge=1, le=100, description='Количество записей на странице'),
    offset: int = Query(default=0, ge=0, description='Сколько записей пропустить') 
):
    user = await get_user(session=session, user_id=user_id)
    if user is None:
        raise HTTPException(status_code=404, detail='User not found')
    
    items, count = await list_items_with_count(
        session=session,
        q=q,
        limit=limit,
        offset=offset,
        user_id=user_id
    )

    return ItemsOut(data=items, count=count)

'''
Все готово, теперь можем тестировать наши эндпоинты!

СОВЕТ ПРЕПОДАВАТЕЛЮ: обязательно протестируйте эндпоинты, чтобы студенты увидели
результаты работы. Также проговорите студентам, что после этого занятия в ЛК
есть точка контроля, куда студентам нужно прикрепить итоговую версию проекта
в виде ссылка GitHub-репозиторий.
'''